/* 1 ЧАСТИНА  */

/* Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.  */

let age = 13;
console.log(age);

/* Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.  */

let name = 'kostya';
console.log( name  );

/* Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом. 
Вивести значення цієї змінної в консоль. 
 */

let isStudent = 'true';
console.log(isStudent);

/* Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. 
 */

let myString = 'It is not me, it is life.';
console.log( myString);

/* Вивести цей рядок в консоль. 
Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.  */

let myNumber = 98;
myNumber = myNumber + 10;
console.log (myNumber);

/* Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль. */

let myNull = 'null';
console.log (myNull);

/* 2 ЧАСТИНА */

/* Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені. */

prompt('Whats your name', 'Kostya');


/* ПОМИЛКА!!! */

/*  Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!". */
 confirm ('Підтвердть дію');

if (confirm) {
    
    alert("Дякую за підтвердження!")}
    
    else  {
        alert("Дію відмінено!");
    };

    /* ПОМИЛКА!!! */

    /*  Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!". */
alert("Дія небезпечна") {
    alert("Дякую за підтвердження!")}
    
    else  {
        alert("Дію відмінено!")
    };
