// Напишіть скрипт для створення випадкового числа з плаваючою крапкою від min до max (не враховуючи max).
console.log((Math.random() * (100 - 1) + 1).toFixed(1));

// Напишіть скрипт для створення випадкового числа з плаваючою крапкою від min до max (не враховуючи max).
console.log((Math.random() * (10 - 15) + 1 + 10).toFixed(1));

// Напишіть скрипт, який просить відвідувача ввести два числа, і в результаті показує їх суму.
const n1 = promt("Введіть перше числове значеня");
const n2 = promt("Введіть друге числове значеня");
const sum = n1 + n2;
alert("Сума навединих чисел" + sum);

//  Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.

const C = promt("Введіть градуси за Цельсієм");
const F = (C * 9) / 5 + 32;
alert("Градуси за Фаренгейтом дорівннюють  " + F);

//  Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const d = promt("Скільки днів у цьому місяці");
const h = d * 24;
const m = h * 60;
alert("У цьому місяці стільки годин:" + h);
alert("У цьому місяці стільки хвилин:" + m);

// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
let hill = "100";
let energy = "100";
energy = 100 - 30;
hill = 100 - 59;
console.log(energy);
console.log(hill);
//  Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.

let suma = "1000";
let sell = "10";
let price = (suma * sell) / 100;
console.log(price);

//Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
let wrongNumber = "7.908095";
console.log(Math.floor(wrongNumber));
//  Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
let secondNumber = "7.43751";
console.log(parseFloat(secondNumber));
//Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.

let num1 = "100.3";
let num2 = parseInt(num1);
console.log(num2);

//Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
let sqrt = "20";
console.log(Math.sqrt(sqrt));








