"use strict";

// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
let i = 1;
while (i <= 10) {
  console.log(i);
  i++;
}
//  Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let a = 0; a < 20; a++) {
  if (a % 2 !== 0) {
    continue;
  }
  console.log(a);
}

//  Вивести на екран таблицю множення числа 7 за допомогою циклу for.

for (let b = 0; b <= 10; ) {
  console.log(b * 7);
  b++;
}
//  Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.
const arr = [1, 2, 3, 4, 5];
let c = 0;
while (i < arr.length) {
  console.log(arr[i]);
  i++;
}

// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.
const arr1 = [1, 2, 3, 4, 5, 6, 7 ,8, 9, 10];
for(let d = 0;;d++){
  console.log(arr1[d]);
  if(d=7){
    break
  } else{
    continue
  }
}


//  За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let f = 1
while(f < 20){
 
  if(f % 3 == 0){
    continue
  } else{
  console.log(f)
  f++
  }
}
