//Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні - "Не всі поля заповнені".
const input1 = document.querySelector('.info1')
const input2 = document.querySelector(".info2")
const btn = document.querySelector('.btn')
function checkInputValue() {
    if(!input1.value === "" && !input2.value === "" ){
alert('Обидва поля заповнені')
    } else{
        alert("Не всі поля заповнені")
    }
}

btn.addEventListener('click', checkInputValue)


//Створити розмітку  з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні - "Сума менша або дорівнює 10".

//зміні взяті з попереднього завдання


function checkSum(){
    if(+input1.value + +input2.value <10){
        alert("Сума більша за 10")
    } else{
        alert('Сума менша або дорівнює 10')
    }
}
btn.addEventListener('click', checkSum)

// Створити розмітку  з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні - "Текст не містить слово JavaScript".

//зміні взяті з першого завдання

function checkInputToJavaScript() {
    if(input1.value = 'JavaScript') {
        alert('Текст містить слово JavaScript')
    } else {
        alert('Текст не містить слово JavaScript')
    }
}

btn.addEventListener('click', checkInputToJavaScript)

//Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні - "Число не входить в діапазон від 10 до 20".

//зміні взяті з першого завдання
 function checkRangeInputValue() {
    if(10<+input1.value<20) {
        alert('Число входить в діапазон від 10 до 20')
    } else{
        alert('Число не входить в діапазон від 10 до 20')
    }
   
 }
 btn.addEventListener('click', checkRangeInputValue)
 // Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні - виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.

 //зміні взяті з першого завдання
function checkNameAndEmail() {
    if(input1=== true && input2 === true){
        btn.value = '<a href="./index.html"></a>'
    } else{
        alert("Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів")
    }
}
btn.addEventListener('click',checkNameAndEmail )