"use strict";

// * Будьте уважні при використанні блокових областей видимості та змінних оголошених в них. Саме ця помилка, разом з неуважністю, часто стає головним болем новачка. * //

// Конструкція switch може замінити кілька if.

// Вона дає можливість більш наочного способу порівняння значення відразу з кількома варіантами.

// І if/else ifоператори, і switch оператор є структурами потоку керування в JavaScript, які використовуються для прийняття рішень на основі різних умов. Хоча вони служать подібним цілям, вони мають різні варіанти використання та переваги:

// Гнучкість : if/else if оператори є більш гнучкими та можуть працювати з широким діапазоном умов. Вони дозволяють перевіряти складні умови за допомогою різноманітних операторів порівняння (наприклад, ===, >, <тощо), логічних операторів ( &&, ||, !) і спеціальних функцій. Ви також можете вкладати if/else оператори, щоб створювати більш складні процеси прийняття рішень.
// Порівняння : це switch твердження в основному використовується для простих порівнянь на основі цінностей. Він обчислює вираз один раз, а потім порівнює отримане значення з кількома реченнями case. Він не підтримує складні умови чи діапазони значень у кожному випадку.
// Читабельність : switch оператор може зробити код більш читабельним і організованим під час обробки серії рівностей щодо однієї змінної. Це особливо корисно при роботі з великою кількістю справ.
// Продуктивність : у деяких випадках switch оператор може бути швидшим, ніж довгі ланцюжки if/else if операторів, коли є кілька випадків і можна знайти пряму відповідність без необхідності оцінювати кожну умову.

// Використовуйте if/else if оператори, коли вам потрібно перевірити складні умови або оцінити кілька умов у певному порядку.
// Використовуйте цей switch оператор, коли у вас є просте порівняння на основі значення з кількома випадками, і кожен випадок прямо збігається з однією змінною.

// Інструкції Switch не можуть включати порівняння. Наприклад, перевірити, чи одна змінна є істинною, а інша – хибною, чи одне число більше іншого.

// Перемикачі призначені для перевірки однієї змінної, яка може бути в одному з багатьох станів.

// Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 - кур"єр, 3 - пошта. В змінну message записати повідомлення в залежності від опції.
// - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
// - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
// - 'Посилка буде відправлена сьогодні'
// - 'Вам передзвонит менеджер'.

//Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100). До якої групи відноситься Максим, якщо йому 55 років. Назву групи вивести на екран.

const years = 55;

if (years > 0 && years < 16) {
  alert("Він дитина");
} else if (years > 17 && years < 60) {
  alert("Він дорослий");
} else if (years > 61 && years < 100) {
  alert("Він пенсіонер");
} else {
  alert("Йому дуже багато років");
}
